app/controllers/members_controller.rb

  def index
    @members = User.order(sort_column + " " + sort_direction)
---
SELECT "users".* FROM "users" WHERE (1) LIMIT $1  [["LIMIT", 1]]

  def show
    @member = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @member = User.new(member_params)
    @member.total_points = 0
    @member.meeting_points = 0
    @member.event_points = 0
    @member.misc_points = 0
    if @member.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "committee", "subcommittee", "total_points", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @member = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @member = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def delete
    @member = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @member = User.find(params[:id])
    @member.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]