app/controllers/sessions_controller.rb

  def create
    redirect_to welcome_path and return unless params[:uin_email].present?
    redirect_to welcome_path and return unless params[:password].present?

    @user = User.find_by(uin: params[:uin_email]) || User.find_by(email: params[:uin_email])
---
SELECT "users".* FROM "users" WHERE "users"."uin" = $1 LIMIT $2  [["uin", 123456789], ["LIMIT", 1]]